Repository: common-repository/buy-now-button-direct-checkout-quick-checkoutpurchase-button-for-woocommerce
Catalog: languages/buy-now-direct-checkout-for-woocommerce-*.po
Languages: de_de, es_es, fr_fr, it_it, nl_nl, pl_pl, ru_ru, vi

source: Buy Now Button, Direct Checkout, Quick Checkout/Purchase Button For WooCommerce
es_es: Botão Comprar Agora, Checkout Direto, Botão Quick Checkout/Compra para WooCommerce
fr_fr: Bouton Acheter maintenant, paiement direct, bouton de paiement rapide/achat pour WooCommerce
it_it: Pulsante Acquista ora, Checkout diretto, Pulsante Quick Checkout/Acquista per WooCommerce
nl_nl: Koop nu-knop, direct afrekenen, snel afrekenen / kopen-knop voor WooCommerce
pl_pl: Przycisk Kup teraz, Bezpośrednia kasa, Przycisk szybkiego kasy/Zakupu dla WooCommerce
ru_ru: Кнопка «Купить сейчас», прямая оплата, кнопка быстрой оплаты/покупки для WooCommerce
vi: Nút Mua ngay, Thanh toán trực tiếp, Thanh toán nhanh / Nút mua hàng cho WooCommerce

source: This plugin will add a "Buy Now" button below the "Add to cart" button that add product to cart and quickly redirects the customer directly to the checkout page for a quick purchase using custom ajax call. This plugin is designed to help boost your business conversion rate by reducing the number of steps required to complete a purchase. With the "Buy Now" button, customers can be taken directly to the checkout page, skipping the traditional cart page redirect of WooCommerce.
de_de: Dieses Plugin fügt eine „Jetzt kaufen“-Schaltfläche unter der „In den Warenkorb“-Schaltfläche hinzu, die das Produkt zum Warenkorb hinzufügt und den Kunden mit einem benutzerdefinierten Ajax-Aufruf schnell direkt zur Checkout-Seite für einen schnellen Kauf weiterleitet. Dieses Plugin wurde entwickelt, um die Konversionsrate Ihres Unternehmens zu steigern, indem es die Anzahl der Schritte reduziert, die zum Abschluss eines Kaufs erforderlich sind. Mit der Schaltfläche „Jetzt kaufen“ können Kunden direkt zur Checkout-Seite geleitet werden, wobei die traditionelle Weiterleitung der Warenkorbseite von WooCommerce übersprungen wird.
es_es: Este plug-in adicionará um botão "Comprar agora" abaixo do botão "Adicionar ao carrinho" que adiciona o produto ao carrinho e redireciona rapidamente o cliente diretamente para a página de checkout para uma compra rápida usando a chamada ajax personalizada. Este plug-in foi projetado para ajudar a aumentar a taxa de conversão de sua empresa, reduzindo o número de etapas necessárias para concluir uma compra. Com o botão "Comprar agora", os clientes podem ser levados diretamente para a página de checkout, pulando o redirecionamento tradicional da página do carrinho do WooCommerce.
fr_fr: Ce plugin ajoutera un bouton "Acheter maintenant" sous le bouton "Ajouter au panier" qui ajoute le produit au panier et redirige rapidement le client directement vers la page de paiement pour un achat rapide à l'aide d'un appel ajax personnalisé. Ce plugin est conçu pour aider à augmenter le taux de conversion de votre entreprise en réduisant le nombre d'étapes nécessaires pour effectuer un achat. Avec le bouton "Acheter maintenant", les clients peuvent être dirigés directement vers la page de paiement, en sautant la redirection traditionnelle de la page de panier de WooCommerce.
it_it: Questo plug-in aggiungerà un pulsante "Acquista ora" sotto il pulsante "Aggiungi al carrello" che aggiunge il prodotto al carrello e reindirizza rapidamente il cliente direttamente alla pagina di pagamento per un acquisto rapido utilizzando la chiamata ajax personalizzata. Questo plugin è progettato per aumentare il tasso di conversione della tua attività riducendo il numero di passaggi necessari per completare un acquisto. Con il pulsante "Acquista ora" i clienti possono essere portati direttamente alla pagina di checkout, saltando il tradizionale reindirizzamento della pagina del carrello di WooCommerce.
nl_nl: Deze plug-in voegt een "Koop nu"-knop toe onder de "Toevoegen aan winkelwagen"-knop die product aan winkelwagentje toevoegt en de klant snel rechtstreeks doorstuurt naar de afrekenpagina voor een snelle aankoop met behulp van een aangepaste ajax-oproep. Deze plug-in is ontworpen om de conversieratio van uw bedrijf te verhogen door het aantal stappen dat nodig is om een aankoop te voltooien, te verminderen. Met de knop "Koop nu" kunnen klanten rechtstreeks naar de afrekenpagina worden geleid, waarbij de traditionele omleiding van de winkelwagenpagina van WooCommerce wordt overgeslagen.
pl_pl: Ta wtyczka doda przycisk „Kup teraz” poniżej przycisku „Dodaj do koszyka”, który dodaje produkt do koszyka i szybko przekierowuje klienta bezpośrednio do strony kasy, aby dokonać szybkiego zakupu za pomocą niestandardowego wywołania ajax. Ta wtyczka ma na celu zwiększenie współczynnika konwersji Twojej firmy poprzez zmniejszenie liczby kroków wymaganych do sfinalizowania zakupu. Za pomocą przycisku „Kup teraz” klienci mogą zostać przeniesieni bezpośrednio do strony kasy, pomijając tradycyjne przekierowanie strony koszyka WooCommerce.
ru_ru: Этот плагин добавит кнопку «Купить сейчас» под кнопкой «Добавить в корзину», которая добавляет товар в корзину и быстро перенаправляет клиента прямо на страницу оформления заказа для быстрой покупки с помощью пользовательского вызова ajax. Этот плагин предназначен для повышения коэффициента конверсии вашего бизнеса за счет сокращения количества шагов, необходимых для совершения покупки. С помощью кнопки «Купить сейчас» клиенты могут быть перенаправлены непосредственно на страницу оформления заказа, минуя традиционную переадресацию страницы корзины WooCommerce.
vi: Plugin này sẽ thêm nút "Mua ngay" bên dưới nút "Thêm vào giỏ hàng" để thêm sản phẩm vào giỏ hàng và nhanh chóng chuyển hướng khách hàng trực tiếp đến trang thanh toán để mua hàng nhanh bằng lệnh gọi ajax tùy chỉnh. Plugin này được thiết kế để giúp tăng tỷ lệ chuyển đổi doanh nghiệp của bạn bằng cách giảm số bước cần thiết để hoàn tất mua hàng. Với nút "Mua ngay", khách hàng có thể được đưa trực tiếp đến trang thanh toán, bỏ qua chuyển hướng trang giỏ hàng truyền thống của WooCommerce.

source: Buy now button settings
de_de: Schaltflächeneinstellungen jetzt kaufen
es_es: Configurações do botão Comprar agora
fr_fr: Paramètres du bouton Acheter maintenant
it_it: Acquista ora le impostazioni del pulsante
nl_nl: Instellingen voor de knop Nu kopen
pl_pl: Ustawienia przycisku Kup teraz
ru_ru: Настройки кнопки «Купить сейчас»
vi: Mua ngay cài đặt nút

source: Buy Now Button
de_de: Schaltfläche "Jetzt kaufen".
es_es: Botão Comprar Agora
fr_fr: Bouton Acheter maintenant
it_it: Pulsante Acquista ora
nl_nl: Koop nu knop
pl_pl: Przycisk Kup teraz
ru_ru: Кнопка «Купить сейчас»
vi: Nút Mua ngay

source: Buy Now, Direct Checkout For WooCommerce Settings.
de_de: Jetzt kaufen, direkter Checkout für WooCommerce-Einstellungen.
es_es: Compre agora, checkout direto para configurações do WooCommerce.
fr_fr: Achetez maintenant, paiement direct pour les paramètres WooCommerce.
it_it: Acquista ora, pagamento diretto per le impostazioni di WooCommerce.
nl_nl: Koop nu, direct afrekenen voor WooCommerce-instellingen.
pl_pl: Kup teraz, bezpośrednia płatność w ustawieniach WooCommerce.
ru_ru: Купить сейчас, прямое оформление заказа для настроек WooCommerce.
vi: Mua ngay bây giờ, thanh toán trực tiếp cho cài đặt WooCommerce.

source: Buy now button CSS class:
de_de: Jetzt kaufen Schaltfläche CSS-Klasse:
es_es: Clase de CSS del botón Comprar ahora:
fr_fr: Acheter maintenant la classe CSS du bouton :
it_it: Acquista ora pulsante Classe CSS:
nl_nl: Koop nu knop CSS-klasse:
pl_pl: Kup teraz przycisk klasy CSS:
ru_ru: Класс CSS кнопки «Купить сейчас»:
vi: Mua ngay lớp CSS nút:

source: Specify CSS class to be applied on Buy now button. (You can specify multiple CSS classes separated by space)
de_de: Geben Sie die CSS-Klasse an, die auf die Schaltfläche „Jetzt kaufen“ angewendet werden soll. (Sie können mehrere durch Leerzeichen getrennte CSS-Klassen angeben.)
es_es: Especifique a classe CSS a ser aplicada no botão Comprar agora. (Você pode especificar várias classes CSS separadas por espaço)
fr_fr: Spécifiez la classe CSS à appliquer sur le bouton Acheter maintenant. (Vous pouvez spécifier plusieurs classes CSS séparées par un espace)
it_it: Specifica la classe CSS da applicare al pulsante Acquista ora. (Puoi specificare più classi CSS separate da spazio)
nl_nl: Specificeer de CSS-klasse die moet worden toegepast op de knop Nu kopen. (U kunt meerdere CSS-klassen opgeven, gescheiden door spatie)
pl_pl: Określ klasę CSS do zastosowania na przycisku Kup teraz. (Możesz określić wiele klas CSS oddzielonych spacją)
ru_ru: Укажите класс CSS, который будет применяться к кнопке «Купить сейчас». (Вы можете указать несколько классов CSS, разделенных пробелом)
vi: Chỉ định lớp CSS sẽ được áp dụng trên nút Mua ngay. (Bạn có thể chỉ định nhiều lớp CSS được phân tách bằng dấu cách)

source: Remove other product from cart
de_de: Entfernen Sie andere Produkte aus dem Warenkorb
es_es: Remover outro produto do carrinho
fr_fr: Supprimer un autre produit du panier
it_it: Rimuovere altro prodotto dal carrello
nl_nl: Ander product uit winkelwagen verwijderen
pl_pl: Usuń inny produkt z koszyka
ru_ru: Удалить другой товар из корзины
vi: Xóa sản phẩm khác khỏi giỏ hàng

source: When checked, previously added product(s) into the cart will be removed and only product(s) added by Buy now button remain in the cart.
de_de: Wenn diese Option aktiviert ist, werden zuvor dem Warenkorb hinzugefügte Produkte entfernt und nur Produkte, die über die Schaltfläche Jetzt kaufen hinzugefügt wurden, verbleiben im Warenkorb.
es_es: Quando marcado, os produtos adicionados anteriormente ao carrinho serão removidos e apenas os produtos adicionados pelo botão Comprar agora permanecerão no carrinho.
fr_fr: Lorsque cette case est cochée, les produits précédemment ajoutés au panier seront supprimés et seuls les produits ajoutés par le bouton Acheter maintenant resteront dans le panier.
it_it: Se selezionato, i prodotti precedentemente aggiunti al carrello verranno rimossi e solo i prodotti aggiunti dal pulsante Acquista ora rimarranno nel carrello.
nl_nl: Indien aangevinkt, worden eerder toegevoegde product(en) in de winkelwagen verwijderd en blijven alleen product(en) die zijn toegevoegd via de knop Nu kopen in de winkelwagen.
pl_pl: Po zaznaczeniu poprzednio dodane produkty do koszyka zostaną usunięte, a w koszyku pozostaną tylko produkty dodane za pomocą przycisku Kup teraz.
ru_ru: Если флажок установлен, ранее добавленные товары в корзину будут удалены, и в корзине останутся только товары, добавленные с помощью кнопки Купить сейчас.
vi: Khi được chọn, (các) sản phẩm đã thêm trước đó vào giỏ hàng sẽ bị xóa và chỉ (các) sản phẩm được thêm bằng nút Mua ngay vẫn còn trong giỏ hàng.

source: Sorry, but "Buy Now, Direct Checkout For WooCommerce" plugin is deactivated as it requires WooCommerce in order to work. Please ensure that WooCommerce is installed and activated.
de_de: Tut mir leid, aber das Plugin „Jetzt kaufen, direkter Checkout für WooCommerce“ ist deaktiviert, da es WooCommerce benötigt, um zu funktionieren. Bitte stellen Sie sicher, dass WooCommerce installiert und aktiviert ist.
es_es: Lo sentimos, pero el complemento "Comprar ahora, Pago directo para WooCommerce" está desactivado ya que requiere WooCommerce para funcionar. Asegúrese de que WooCommerce esté instalado y activado.
fr_fr: Désolé, mais le plugin "Achetez maintenant, paiement direct pour WooCommerce" est désactivé car il nécessite WooCommerce pour fonctionner. Veuillez vous assurer que WooCommerce est installé et activé.
it_it: Siamo spiacenti, ma il plug-in "Acquista ora, pagamento diretto per WooCommerce" è disattivato poiché richiede WooCommerce per funzionare. Assicurati che WooCommerce sia installato e attivato.
nl_nl: Sorry, maar de plug-in "Koop nu, direct afrekenen voor WooCommerce" is gedeactiveerd omdat WooCommerce nodig is om te werken. Zorg ervoor dat WooCommerce is ge√Ønstalleerd en geactiveerd.
pl_pl: Przepraszamy, ale wtyczka „Kup teraz, Direct Checkout For WooCommerce” jest dezaktywowana, ponieważ wymaga WooCommerce do działania. Upewnij się, że WooCommerce jest zainstalowany i aktywowany.
ru_ru: Извините, но плагин «Купить сейчас, прямая оплата для WooCommerce» деактивирован, так как для его работы требуется WooCommerce. Убедитесь, что WooCommerce установлен и активирован.
vi: Rất tiếc, plugin "Mua ngay, thanh toán trực tiếp cho WooCommerce" đã bị vô hiệu hóa vì nó yêu cầu WooCommerce để hoạt động. Hãy đảm bảo rằng WooCommerce đã được cài đặt và kích hoạt.

source: Buy now
de_de: Kaufe jetzt
es_es: Compre Agora
fr_fr: Acheter maintenant
it_it: Acquista ora
nl_nl: Nu kopen
pl_pl: Kup Teraz
ru_ru: Купи сейчас
vi: Mua ngay

source: Error : Security check failed!
de_de: Fehler: Sicherheitsüberprüfung fehlgeschlagen!
es_es: Erro: Falha na verificação de segurança!
fr_fr: Erreur : Le contrôle de sécurité a échoué !
it_it: Errore: Controllo di sicurezza fallito!
nl_nl: Fout: Beveiligingscontrole mislukt!
pl_pl: Błąd: kontrola bezpieczeństwa nie powiodła się!
ru_ru: Ошибка: проверка безопасности не удалась!
vi: Lỗi: Kiểm tra bảo mật không thành công!

source: Error : Product data not received
de_de: Fehler: Produktdaten nicht erhalten
es_es: Erro: dados do produto não recebidos
fr_fr: Erreur : Données produit non reçues
it_it: Errore: dati del prodotto non ricevuti
nl_nl: Fout: Productgegevens niet ontvangen
pl_pl: Błąd: nie otrzymano danych produktu
ru_ru: Ошибка: данные о продукте не получены
vi: Lỗi: Không nhận được dữ liệu sản phẩm

source: Error : Product variation data not received
de_de: Fehler: Produktvariationsdaten nicht empfangen
es_es: Erro: dados de variação do produto não recebidos
fr_fr: Erreur : Données de variation du produit non reçues
it_it: Errore: i dati della variazione del prodotto non sono stati ricevuti
nl_nl: Fout: productvariatiegegevens niet ontvangen
pl_pl: Błąd: nie otrzymano danych o odmianach produktu
ru_ru: Ошибка: данные о вариантах продукта не получены
vi: Lỗi: Không nhận được dữ liệu biến thể sản phẩm

source: Error: Cart object not defined
de_de: Fehler: Einkaufswagenobjekt nicht definiert
es_es: Erro: objeto do carrinho não definido
fr_fr: Erreur : Objet du panier non défini
it_it: Errore: oggetto carrello non definito
nl_nl: Fout: productvariatiegegevens niet ontvangen
pl_pl: Błąd: Nie zdefiniowano obiektu koszyka
ru_ru: Ошибка: объект корзины не определен
vi: Lỗi: Đối tượng giỏ hàng không được xác định
